code/openfoam/tutorials/multiphaseEuler/injection/constant/heatTransfer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      heatTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blending        default;

air_dispersedIn_water
{
    type            RanzMarshall;
    residualAlpha   1e-3;
}

water_dispersedIn_air
{
    type            RanzMarshall;
    residualAlpha   1e-3;
}

// ************************************************************************* //
